app/views/posts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 101], ["LIMIT", 1]]
---
                  <br>
                   <% if current_user == User.find(params[:user_id]) %>