app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 101], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 101]]
---
  def index
    @posts = User.find(params[:user_id]).posts

INSERT INTO "posts" ("user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["title", "asdasdasd mother fucker"], ["content", ""], ["created_at", 2017-04-05 13:20:23 UTC], ["updated_at", 2017-04-05 13:20:23 UTC]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save