app/controllers/tags_controller.rb

	def create
		Tag.create user_id: params[:user_id], post_id: params[:post_id]
---
INSERT INTO "tags" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 101], ["post_id", 4], ["created_at", 2017-04-05 14:37:19 UTC], ["updated_at", 2017-04-05 14:37:19 UTC]]